Revit 2027 API
BuiltInFailures.GlobalParameterFailures.ElementPropLinkCircularChainError Property
 Linked properties in highlighted elements cause a circular chain of references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementPropLinkCircularChainError { get; }
Public Shared ReadOnly Property ElementPropLinkCircularChainError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementPropLinkCircularChainError {
	FailureDefinitionId^ get ();
}
static member ElementPropLinkCircularChainError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GlobalParameterFailures Class
Autodesk.Revit.DB Namespace